{
  "brand": "Jusheng",
  "contact": "Contact Us",

  "starter-title": "Providing Comprehensive Talc Industry Chain Solutions for You",
  "starter-description": "We specialize in the talc industry, leveraging the resources of the Guangfeng mining area in Jiangxi. We integrate raw ore mining, fine processing, new material R&D, and product sales to form a product system centered around black talc ore particles, black talc powder, black talc masterbatch, and calcined talc. The company brings together experts in ceramics, coatings, kilns, and other fields, pioneering the roller kiln calcination technology for talc, with an annual production capacity of 100,000 tons. We are committed to providing high-quality full industry chain services for talc.",

  "why-us-title": "Why Choose Jusheng?",
  "why-us-point-title-1": "Leading: Leading Domestic Production System",
  "why-us-point-detail-1": "The company has several fully automated roller kiln production lines. All production lines are controlled by PLC automation, using multiple sets of advanced domestic production equipment to form a standardized powder processing production system with modular operation, ensuring product quality stability and achieving an annual production capacity of 100,000 tons of calcined talc. Additionally, the production lines use cleaner natural gas fuel for calcination, improving production efficiency while ensuring environmental protection and further optimizing product whiteness.",
  "why-us-point-title-2": "Professional: Industry's Top Professional Team",
  "why-us-point-detail-2": "The company has a professional team mastering core technologies. The core personnel of the company are mostly graduates from South China University of Technology, Jingdezhen Ceramic University, and other institutions, with many years of industry experience in ceramic materials, coatings, and new materials. At the mining end, the company is in a strategic partnership with the mining company. At the production end, the roller kiln calcination technology used by the company was designed, tested, and successfully modified by itself. At the sales end, the company relies on a mature sales network to precisely serve different links of the industry chain.",
  "why-us-point-title-3": "Focused: Dedicated R&D Team",
  "why-us-point-detail-3": "The company has a professional talc R&D base. By introducing professional technical talents and establishing a specialized R&D laboratory, Jusheng ensures its current and future research and innovation capabilities for black talc products. From formulation design to powder process control and downstream application system management, we conduct in-depth research and innovation, developing the country's first roller kiln talc calcination technology, among others, and are committed to exploring more application directions for black talc and making efforts in new product development.",

  "product-1-title": "Black Talc Ore Particles",
  "product-1-description": "The main mineral components of black talc typically include talc, quartz, organic carbon, etc. The color ranges from black to gray-black, and the main chemical components are magnesium oxide and silicon oxide. Our black talc comes from Guangfeng, Jiangxi, which is the largest black talc deposit discovered in China so far, with proven reserves of 1 billion tons, making it the largest black talc mining area in the world.",
  "product-1-point-1": "[Mesh] 200-2800",
  "product-1-point-2": "[Whiteness] >90",
  "product-1-point-3": "[Iron Content] <0.1",
  "product-1-point-4": "[Magnesium Content] >27",

  "product-2-title": "Black Talc Powder",
  "product-2-description": "Various particle sizes are deeply processed using vertical mills, jet mills, and other equipment. Magnesium porcelain is one of the main applications of black talc powder, with a usage rate of over 75%. Magnesium porcelain is a high-end porcelain with a fine, milky white texture, a fatty luster, and a smooth feel. It has outstanding characteristics such as high whiteness, high strength, good translucency, and high thermal stability. Black talc ultrafine powder can also be widely used in engineering plastics, pipelines, wires, and cables.",
  "product-2-point-1": "[Mesh] 200-2800",
  "product-2-point-2": "[Whiteness] >90",
  "product-2-point-3": "[Iron Content] <0.1",
  "product-2-point-4": "[Magnesium Content] >27",

  "product-3-title": "Black Talc Masterbatch",
  "product-3-description": "Using advanced internal mixing and granulation technology, processed black talc is used as one of the main raw materials for producing plastic masterbatches. The black talc powder is converted into granules, which can be used to produce various modified masterbatches such as color masterbatch, whitening masterbatch, flame retardant masterbatch, and antistatic masterbatch. While meeting environmental requirements, we strive to reduce transportation costs, providing convenience for customers to better mix plastic masterbatches.",
  "product-3-point-1": "[Mesh] 200-2800",
  "product-3-point-2": "[Whiteness] >90",
  "product-3-point-3": "[Iron Content] <0.1",
  "product-3-point-4": "[Magnesium Content] >27",

  "product-4-title": "Calcined Talc",
  "product-4-description": "After high-temperature calcination, black talc loses its crystalline water and organic carbon, and its layered crystal structure changes to a chain structure. The hardness increases, the texture becomes soft, the abrasiveness is low, and it has good suspension and dispersibility. It has a high degree of water resistance and permeability resistance. After calcination, the whiteness can reach more than 95%, and it is commonly used in high-end ceramics such"
}
