{
  "brand": "Jusheng",
  "contact": "Contact Us",

  "starter-title": "Natural 369 Quality Talc ",
  "starter-description": "Backing the resources of Jiangxi Guangfeng mine area, known as the 'World Capital of Talc', we gather experienced professionals in ceramics, coatings, kilns, and other fields to build a talc research and development base, initiating the roller kiln calcination talc technology domestically for the first time.",
  "watch-video": "Watch Video",

  "why-us-title": "Why Choose Jusheng?",
  "why-us-point-title-1": "Leadership: Leading production system domestically",
  "why-us-point-detail-1": "The company has several fully automated roller kiln production lines. The production lines are all under PLC automatic control. Through the introduction of a number of advanced domestic production equipment, a standardized powder processing production system is formed by the modular operating system, ensuring the stability of product quality and achieving a calcinated talc production capacity of 100,000 tons per year. The production line utilizes cleaner natural gas fuel for calcination, improving production efficiency and further enhancing product whiteness.",
  "why-us-point-title-2": "Professionalilg: Top professional team in the industry",
  "why-us-point-detail-2": "The company has a professional team with core technology. The core staff of the company are mostly graduates from South China University of Technology, Jingdezhen Ceramic University, and other universities, with many years of industry experience in ceramic materials, coatings, and new materials. At the mineral source end, our company has a strategic partnership relationship with the product mining company. At the production end, the roller kiln calcination technology used by the company is designed, tested, and successfully transformed by itself. At the sales end, the company relies on a mature sales network, accurately serving different links in the industry chain.",
  "why-us-point-title-3": "Focus: Deeply cultivating technical research and development team",
  "why-us-point-detail-3": "The company owns a professional talc research and development base. By introducing professional technical talents and setting up specialized research and development laboratories, the current and future research, and innovation capabilities of Jusheng for black talc products are guaranteed. From formula design, to powder process control and system control of downstream applications, in-depth research and innovation are carried out, developing the first roller kiln talc calcination technology in China, focusing on the development of more application directions of black talc, and making efforts in new product development.",

  "product-1-title": "Black Talc Ore Pellets",
  "product-1-description": "The main mineral components of black talc usually consist of talc, quartz, organic carbon, etc. The color is black to gray-black, and the main chemical components are magnesium oxide and silicon dioxide. Our black talc is produced in Jiangxi Guangfeng, which is the largest black talc deposit discovered in China so far, with proven reserves of 1 billion tons and is also the world's largest black talc mining area.",
  "product-1-point-1": "[Mesh Size] 200-2800",
  "product-1-point-2": "[Whiteness] >90",
  "product-1-point-3": "[Iron content] <0.1",
  "product-1-point-4": "[Magnesium content] >27",

  "product-2-title": "Black Talc Powder",
  "product-2-description": "Deep-process various particle size powders with vertical mill and airflow mill equipment. Magnesite ceramics is one of the main applications of black talc powder, and the usage can reach more than 75%. Magnesite ceramics are a kind of high-grade ceramics, with a delicate and milky ceramic texture, a fat gloss, a smooth touch, high whiteness, high strength, good translucency, high thermal stability, and other outstanding features. At the same time, black talc ultrafine powder can be widely used in engineering plastics, pipes, wires and cables, and other products.",
  "product-2-point-1": "[Mesh Size] 200-2800",
  "product-2-point-2": "[Whiteness]>90",
  "product-2-point-3": "[Iron content] <0.1",
  "product-2-point-4": "[Magnesium content] >27",

  "product-3-title": "Black Talc Masterbatch",
  "product-3-description": "We utilize advanced compounding granulation technology to make processed black talc one of the main raw materials for the production of plastic masterbatch. Black talc powder is converted into granules, which can produce various modified masterbatches such as plastic color masterbatch, whitening masterbatch, flame retardant masterbatch, and antistatic masterbatch. While meeting environmental protection requirements, we strive to reduce transportation costs and provide convenience for customers for better compounding plastic masterbatch.",
  "product-3-point-1": "[Mesh Size] 200-2800",
  "product-3-point-2": "[Whiteness] >90",
  "product-3-point-3": "[Iron content] <0.1",
  "product-3-point-4": "[Magnesium content] >27",

  "product-4-title": "Calcinated Talc",
  "product-4-description": "After high-temperature calcination, black talc loses its crystal water and organic carbon. The layer-type crystal structure changes to a chain structure, and the hardness increases. It has a soft texture and low abrasion and has good suspension and dispersibility. With a high degree of water resistance and seepage resistance. After calcination, the whiteness can reach more than 95%. It is commonly used in high-grade ceramics like polished bricks, glazes, magnesite ceramics, disinfection tableware, sanitary ceramics, etc. It has high impact strength and bending strength, reduces the sintering temperature, and other characteristics.",
  "product-4-point-1": "[Mesh Size] 200-3000",
  "product-4-point-2": "[Whiteness] >90",
  "product-4-point-3": "[Iron content] <0.1",
  "product-4-point-4": "[Magnesium content] >30",

  "original-1-title": "Mineral Origin",
  "original-1-description": "The ore in the Guangfeng district is a rare high-grade talc ore domestically. The effective components such as silicon and magnesium in the ore are high, and harmful impurities such as sulfur and calcium are low. The whiteness can reach 95% after calcination, as a filler for the chemical industry. It is mainly used in industries such as ceramics, paint, coatings, plastics, cables, blueprint paper, pharmaceuticals, cosmetics, etc.",
  "original-1-point-1": "[Black Talc Reserves] >1 billion tons",
  "original-1-point-2": "[World Reserves] First",
  "original-1-point-3": "[Iron content] <0.1",
  "original-1-point-4": "[Grade Magnesium Oxide Content] Average of 26%-28%",

  "quality-title": "Quality Assurance",
  "quality-description": "Original “369“ Quality | 30% Magnesium content, 60% Silicon content, 90% Whiteness",
  "quality-point-1": "High calcination whiteness",
  "quality-point-2": "High original quality, low iron content",
  "quality-point-3": "Large radius of the place of origin",
  "quality-point-4": "Large storage, stable supply",

  "about-title": "Company Introduction",
  "about-description": "Guangdong Jusheng New Materials Co., Ltd., established in October 2022, is headquartered in Sanshui District, Foshan City, Guangdong Province. The company focuses on the talc industry and backs the resources of the Jiangxi Guangfeng mining area, known as the 'World Capital of Talc'. By integrating industry resources such as original ore mining, ore fine processing, talc new material research and development, and product sales in the talc industry chain, we have created a product matrix centered on black talc ore particles, black talc powder, black talc masterbatch, and calcinated talc. We provide comprehensive services covering the entire talc industry chain. The company gathers experienced professionals in ceramics, coatings, kilns, and other fields to build a talc research and development base, initiating the roller kiln calcination talc technology domestically for the first time, currently with a calcination talc production processing capacity of 100,000 tons per year.",

  "application-title": "Application Scope",

  "report-title": "Test Report",

  "email": "Email",
  "phone": "Phone",
  "phone-mr-zhuang": "Mr.Zhuang",
  "phone-mr-wang": "Mr.Wang",
  "address": "Address",
  "address-detail": "Foshan Sanshui District southwest Street ZhoubianJinxiang Road No.3 09 workshop",

  "application-1": "Plastic",
  "application-2": "Ceramics",
  "application-3": "Coatings",
  "application-4": "Rubber",
  "application-5": "Pharmaceuticals",
  "application-6": "Papermaking",

  "Home": "Home",
  "About": "About",
  "Product": "Product",
  "Application": "Application",
  "Strength": "Strength"
}
